package num2words

type gender int

const (
	Feminine gender = iota
	Masculine
	Neuter
)

var one = [...]string{
	"ноль",
	"один",
	"два",
	"три",
	"четыре",
	"пять",
	"шесть",
	"семь",
	"восемь",
	"девять",
	"десять",
	"одиннадцать",
	"двенадцать",
	"тринадцать",
	"четырнадцать",
	"пятнадцать",
	"шестнадцать",
	"семнадцать",
	"восемнадцать",
	"девятнадцать",
}

var ten = [...]string{
	"",
	"",
	"двадцать",
	"тридцать",
	"сорок",
	"пятьдесят",
	"шестьдесят",
	"семьдесят",
	"восемьдесят",
	"девяносто",
}

var hundred = [...]string{
	"",
	"сто",
	"двести",
	"триста",
	"четыреста",
	"пятьсот",
	"шестьсот",
	"семьсот",
	"восемьсот",
	"девятьсот",
}

var orderedOneFeminine = [...]string{
	"нолевая",
	"первая",
	"вторая",
	"третья",
	"четвертая",
	"пятая",
	"шестая",
	"седьмая",
	"восьмая",
	"девятая",
	"десятая",
	"одиннадцатая",
	"двенадцатая",
	"тринадцатая",
	"четырнадцатая",
	"пятнадцатая",
	"шестнадцатая",
	"семнадцатая",
	"восемнадцатая",
	"девятнадцатая",
}

var orderedTenFeminine = [...]string{
	"",
	"",
	"двадцатая",
	"тридцатая",
	"сороковая",
	"пятьдесятая",
	"шестьдесятая",
	"семидесятая",
	"восьмидесятая",
	"девяностая",
}

var orderedHundredFeminine = [...]string{
	"",
	"сотая",
	"двухсотая",
	"трёхсотая",
	"четырехсотая",
	"пятисотая",
	"шестисотая",
	"семисотая",
	"восьмисотая",
	"девятисотая",
}

var orderedOneMasculine = [...]string{
	"нолевой",
	"первый",
	"второй",
	"третий",
	"четвертый",
	"пятый",
	"шестой",
	"седьмой",
	"восьмой",
	"девятый",
	"десятый",
	"одиннадцатый",
	"двенадцатый",
	"тринадцатый",
	"четырнадцатый",
	"пятнадцатый",
	"шестнадцатый",
	"семнадцатый",
	"восемнадцатый",
	"девятнадцатый",
}

var orderedTenMasculine = [...]string{
	"",
	"",
	"двадцатый",
	"тридцатый",
	"сороковой",
	"пятидесятый",
	"шестидесятый",
	"семидесятый",
	"восьмидесятый",
	"девяностый",
}

var orderedHundredMasculine = [...]string{
	"",
	"сотый",
	"двухсотый",
	"трёхсотый",
	"четырехсотый",
	"пятисотый",
	"шестисотый",
	"семисотый",
	"восьмисотый",
	"девятисотый",
}

var orderedOneNeuter = [...]string{
	"нолевое",
	"первое",
	"второе",
	"третье",
	"четвертое",
	"пятое",
	"шестое",
	"седьмое",
	"восьмое",
	"девятое",
	"десятое",
	"одиннадцатое",
	"двенадцатое",
	"тринадцатое",
	"четырнадцатое",
	"пятнадцатое",
	"шестнадцатое",
	"семнадцатое",
	"восемнадцатое",
	"девятнадцатое",
}

var orderedTenNeuter = [...]string{
	"",
	"",
	"двадцатый",
	"тридцатый",
	"сороковой",
	"пятидесятый",
	"шестидесятый",
	"семидесятый",
	"восьмидесятый",
	"девяностый",
}

var orderedHundredNeuter = [...]string{
	"",
	"сотое",
	"двухсотое",
	"трёхсотое",
	"четырехсотое",
	"пятисотое",
	"шестисотое",
	"семисотое",
	"восьмисотое",
	"девятисотое",
}

var orderedOnePlural = [...]string{
	"нолевые",
	"первые",
	"вторые",
	"третьи",
	"четвертые",
	"пятые",
	"шестые",
	"седьмые",
	"восьмые",
	"девятые",
	"десятые",
	"одиннадцатые",
	"двенадцатые",
	"тринадцатые",
	"четырнадцатые",
	"пятнадцатые",
	"шестнадцатые",
	"семнадцатые",
	"восемнадцатые",
	"девятнадцатые",
}

var orderedTenPlural = [...]string{
	"",
	"",
	"двадцатые",
	"тридцатые",
	"сороковые",
	"пятидесятые",
	"шестидесятые",
	"семидесятые",
	"восьмидесятые",
	"девяностые",
}

var orderedHundredPlural = [...]string{
	"",
	"сотые",
	"двухсотые",
	"трёхсотые",
	"четырехсотые",
	"пятисотые",
	"шестисотые",
	"семисотые",
	"восьмисотые",
	"девятисотые",
}
